cask_args appdir: "/Applications"

###############################################################################
# Third-Party Homebrew Taps
###############################################################################
tap "tclass/cloud_sql_proxy"
tap "homebrew/cask-versions" # For docker-edge, etc
tap "homebrew/cask-fonts" # For installing preferred terminal fonts, etc
tap "heroku/brew" # For the Heroku CLI
tap "holgerbrandl/tap" # for KScript (Kotlin scripting)
tap "aoki/redis-cli" # For installing the Redis CLI (without installing Redis Server)
tap "graalvm/tap"

###############################################################################
# Core dependencies and high-priority installs
###############################################################################
cask "xquartz"
cask "adoptopenjdk"
brew "mas"
brew "asdf"
brew "nano"
cask "google-chrome"
cask "istat-menus"
cask "slack"
cask "zoom"
cask "notion"
cask "iterm2"
cask "visual-studio-code"
cask "visual-studio-code-insiders" # for native Apple Silicon support
cask "intellij-idea"
cask "keybase"
cask "adobe-creative-cloud" # Actual Adobe apps will need to be installed separately
mas "1Password", id: 443987910

###############################################################################
# Command line apps to install via Homebrew
###############################################################################
brew "ack"
brew "ansible"
brew "asciinema"
brew "awk"
brew "aws-iam-authenticator"
brew "aws-shell"
brew "awscli"
brew "azure-cli"
brew "bash"
brew "bc"
brew "bfg"
brew "boost"
brew "bzip2"
brew "cairo"
brew "cloc"
brew "cloud_sql_proxy"
brew "curl"
brew "diceware"
brew "diffstat"
brew "diffutils"
brew "ec2-ami-tools"
brew "ec2-api-tools"
brew "ed"
brew "expect"
brew "ffmpeg"
brew "file-formula"
brew "findutils"
brew "git"
brew "git-lfs"
brew "gnu-tar"
brew "gnu-getopt"
brew "gnupg2"
brew "gpatch"
brew "graphicsmagick"
brew "grep"
brew "groff"
brew "gzip"
brew "heroku"
brew "heroku/brew/heroku"
brew "holgerbrandl/tap/kscript"
brew "htop"
brew "httpie"
brew "imagemagick"
brew "jq"
brew "kafkacat"
brew "less"
brew "libxml2"
brew "libxslt"
brew "lsof", link: true
brew "mad"
brew "make"
brew "ncurses"
brew "openssl"
brew "p7zip"
brew "pipenv"
brew "pv"
brew "redis-cli"
brew "ripgrep"
brew "rsync"
brew "screen"
brew "skaffold"
brew "socat"
brew "sox"
brew "sqlite"
brew "ssh-copy-id"
brew "stunnel"
brew "tcpdump"
brew "thrift"
brew "tmux"
brew "tree"
brew "unzip"
brew "wget"
brew "vim"
brew "whois"
brew "youtube-dl"
brew "zlib"
brew "zsh-completions"
brew "zsh"

###############################################################################
# Desktop apps to install via Cask
###############################################################################
cask "alfred"
cask "bartender"
cask "betterzip"
cask "brave-browser"
cask "caffeine"
cask "camunda-modeler"
cask "charles"
cask "cheatsheet"
cask "cleanshot"
cask "clickup"
cask "dash"
cask "datagrip"
cask "deckset"
cask "docker"
cask "encryptme"
cask "firefox"
cask "font-meslo-for-powerline"
cask "goland"
cask "google-chrome-canary"
cask "google-drive-file-stream"
cask "graalvm-ce-lts-java11"
cask "grammarly"
cask "handbrake"
cask "iina"
cask "insomnia"
cask "kindle"
cask "lens"
cask "microsoft-office"
cask "microsoft-teams"
cask "miro"
cask "phantomjs"
cask "pycharm"
cask "quickbooks-online"
cask "rar"
cask "sketch"
cask "skype"
cask "sourcetree"
cask "spectacle"
cask "superhuman"
cask "transmit"
cask "vagrant"
cask "vip-access"
cask "viscosity"
cask "vmware-fusion"

###############################################################################
# Desktop apps to install via Mac App Store
###############################################################################
mas "Disk Expert", id: 488920185
mas "EasyRes", id: 688211836
mas "Fantastical 2", id: 975937182
mas "feedly", id: 865500966
mas "Harvest", id: 506189836
mas "Keynote", id: 409183694
mas "Microsoft Remote Desktop", id: 715768417
mas "Mindnode 6", id: 1289197285
mas "Numbers", id: 409203825
mas "Omnigraffle 7", id: 1142578753
mas "Pages", id: 409201541
mas "Paste", id: 967805235
mas "Patterns", id: 429449079
mas "Post-It", id: 1475777828
mas "Screenflow 10", id: 1568414480
mas "Smart JSON Editor", id: 1268962404
mas "Textual 7", id: 1262957439
mas "TickTick", id: 966085870
mas "Tweetbot", id: 1384080005
mas "Vimeo", id: 1356686763
mas "Xcode", id: 497799835

#######################################
# @divideby0 Personal Apps
#######################################
cask "ableton-live-suite"
cask "spotify"
cask "native-access" # Native Instruments Installer
mas "Blackmagic RAW Player", id: 1435415804

#######################################
# Archived
#######################################
# brew "sbt"
# brew "shellcheck", args: ["build-from-source"] | this doesn't seem to install cleanly for unknown reasons
# brew "svn"
# cask "bettertouchtool"
# cask "font-montserrat"
# cask "font-source-code-pro-for-powerline"
# cask "framer-x"
# cask "google-cloud-sdk"
# cask "quik"
# cask "unity"
# mas "Shop", id: 1223471316 # Shopify Shipment Tracker (iOS) | doesn't install cleanly bc ios?
# mas "Spark", id: 1176895641
# mas "WhatsApp Desktop", id: 1147396723