cask_args appdir: "/Applications"

###############################################################################
# Third-Party Homebrew Taps
###############################################################################
tap "heroku/brew" # For the Heroku CLI
tap "ringohub/redis-cli" # For installing the Redis CLI (without installing Redis Server)

###############################################################################
# Core dependencies and high-priority installs
###############################################################################
cask "xquartz"
brew "mas"
brew "asdf"
brew "nano"
brew "zsh"
cask "1password"
cask "google-chrome"
cask "istat-menus"
cask "slack"
cask "zoom"
cask "iterm2"
cask "visual-studio-code"
cask "keybase"
cask "adobe-creative-cloud"

###############################################################################
# Command line apps to install via Homebrew
###############################################################################

brew "ack"
brew "antlr"
brew "aom"
brew "aria2"
brew "asciinema"
brew "autoconf"
brew "automake"
brew "avro-c"
brew "awk"
brew "aws-iam-authenticator"
brew "bash"
brew "bc"
brew "bfg"
brew "boost"
brew "brotli"
brew "bzip2"
brew "ca-certificates"
brew "cairo"
brew "cloc"
brew "coreutils"
brew "curl"
brew "cypher-shell"
brew "diceware"
brew "diffstat"
brew "diffutils"
brew "docbook-xsl"
brew "docbook"
brew "docker-compose"
brew "doppler"
brew "ed"
brew "exiftool"
brew "expect"
brew "fdupes"
brew "ffmpeg"
brew "file-formula"
brew "findutils"
brew "flac"
brew "git-lfs"
brew "git"
brew "glib"
brew "gnu-getopt"
brew "gnupg"
brew "gpatch"
brew "graphicsmagick"
brew "grep"
brew "groff"
brew "gzip"
brew "heroku"
brew "htop"
brew "httpie"
brew "imagemagick"
brew "jdupes"
brew "jq"
brew "kcat"
brew "kops"
brew "ksync"
brew "lame"
brew "less"
brew "libxml2"
brew "libxslt"
brew "lsof", link: true
brew "lua"
brew "lz4"
brew "lzlib"
brew "lzo"
brew "mad"
brew "make"
brew "ncurses"
brew "openjdk"
brew "openssl@3"
brew "p11-kit"
brew "p7zip"
brew "pbzip2"
brew "pipenv"
brew "pkg-config"
brew "postgresql@17"
brew "psutils"
brew "pv"
brew "rclone"
brew "ripgrep"
brew "rsync"
brew "screen"
brew "six"
brew "snappy"
brew "snzip"
brew "socat"
brew "sox"
brew "sqlite"
brew "srt"
brew "ssh-copy-id"
brew "stunnel"
brew "tcpdump"
brew "teleport"
brew "tesseract"
brew "tldr"
brew "tmux"
brew "tor"
brew "tree"
brew "unzip"
brew "velero"
brew "vercel-cli"
brew "vim"
brew "watch"
brew "watchexec"
brew "wget"
brew "whois"
brew "wireguard-go"
brew "wireguard-tools"
brew "x264"
brew "x265"
brew "xclip"
brew "xz"
brew "youtube-dl"
brew "zlib"
brew "zsh-completions"
brew "zsh"
brew "zstd"

###############################################################################
# Desktop apps to install via Cask
###############################################################################
# cask "mactex"
cask "1password-cli"
cask "android-file-transfer"
cask "bartender"
cask "betterzip"
cask "blender"
cask "boltai"
cask "brave-browser"
cask "caffeine"
cask "camunda-modeler"
cask "charles"
cask "chatgpt"
cask "cheatsheet"
cask "cleanshot"
cask "clickup"
cask "cursor"
cask "dash"
cask "datagrip"
cask "deckset"
cask "discord"
cask "docker"
cask "elgato-control-center"
cask "elgato-stream-deck"
cask "expressvpn"
cask "figma"
cask "firefox"
cask "font-meslo-for-powerline"
cask "goland"
cask "google-cloud-sdk"
cask "google-drive"
cask "google-earth-pro"
cask "grammarly-desktop"
cask "handbrake"
cask "iina"
cask "insomnia"
cask "insta360-studio"
cask "intellij-idea"
cask "keyboard-cleaner"
cask "kindle"
cask "lens"
cask "losslesscut"
cask "microsoft-auto-update"
cask "microsoft-office"
cask "microsoft-teams"
cask "miro"
cask "ngrok"
cask "nomad"
cask "notion"
cask "obs"
cask "phantomjs"
cask "plex-media-server"
cask "plex"
cask "postman-agent"
cask "postman-cli"
cask "postman"
cask "pritunl"
cask "pycharm"
cask "rar"
cask "raycast"
cask "rectangle"
cask "secure-pipes"
cask "setapp"
cask "sketch"
cask "skype"
cask "smcfancontrol"
cask "superhuman"
cask "tor-browser"
cask "transmit"
cask "ubiquiti-unifi-controller"
cask "veracrypt"
cask "viscosity"
cask "visual-studio"
cask "vlc"
cask "vnc-viewer"
cask "xquartz"

###############################################################################
# Desktop apps to install via Mac App Store
###############################################################################
mas "Apple Developer", id: 640199958
mas "AS Timer Pro", id: 1486015273
mas "Disk Space Analyzer Pro", id: 488920185
mas "EasyRes", id: 688211836
mas "Fantastical", id: 975937182
mas "Hex Field", id: 1342896380
mas "Keynote", id: 409183694
mas "Microsoft Remote Desktop", id: 715768417
mas "Mindnode", id: 1289197285
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Paste", id: 967805235
mas "Patterns", id: 429449079
mas "Perplexity", id: 6714467650
mas "RSA Authenticator (SecurID)", id: 318038618
mas "Screenflow 10", id: 1568414480
mas "Tailscale", id: 1475387142
mas "Tailscale", id: 1475387142
mas "Testflight", id: 899247664
mas "Textual 7", id: 1262957439
mas "Twitter", id: 1482454543
mas "Wireguard", id: 1451685025
mas "Xcode", id: 497799835

# deprecated: mas "TickTick", id: 966085870

#######################################
# @divideby0 Personal Apps
#######################################
cask "ableton-live-suite"
cask "audacity"
cask "lrtimelapse"
cask "native-access"
cask "splice"
cask "spotify"
cask "waves-central"
cask "whatsapp"
mas "Aja System Test Lite", id: 1092006274
mas "Blackmagic Disk Speed Test", id: 425264550
mas "Blackmagic RAW Player", id: 1435415804
mas "Final Cut Pro X", id: 424389933
mas "Little Snitch Mini", id: 1341167825
mas "Logic Pro", id: 634148309
mas "TickTick", id: 966085870
