cask_args appdir: "/Applications"

###############################################################################
# Third-Party Homebrew Taps
###############################################################################
tap "tclass/cloud_sql_proxy"
tap "homebrew/cask-fonts" # For installing preferred terminal fonts, etc
tap "heroku/brew" # For the Heroku CLI
tap "holgerbrandl/tap" # for KScript (Kotlin scripting)
tap "aoki/redis-cli" # For installing the Redis CLI (without installing Redis Server)
tap "graalvm/tap"

###############################################################################
# Core dependencies and high-priority installs
###############################################################################
cask "xquartz"
cask "adoptopenjdk"
brew "mas"
brew "asdf"
brew "nano"
brew "zsh"
cask "1password"
cask "google-chrome"
cask "istat-menus"
cask "slack"
cask "zoom"
cask "iterm2"
cask "visual-studio-code"
cask "keybase"
cask "adobe-creative-cloud" # Actual Adobe apps will need to be installed separately

###############################################################################
# Command line apps to install via Homebrew
###############################################################################

brew "ack"
brew "antlr"
brew "aom"
brew "aria2"
brew "asciinema"
brew "autoconf"
brew "automake"
brew "avro-c"
brew "awk"
brew "aws-iam-authenticator"
brew "awscli"
brew "bash"
brew "bc"
brew "bfg"
brew "boost"
brew "brotli"
brew "bzip2"
brew "ca-certificates"
brew "cairo"
brew "cloc"
brew "cloud_sql_proxy"
brew "coreutils"
brew "curl"
brew "cypher-shell"
brew "diceware"
brew "diffstat"
brew "diffutils"
brew "docbook"
brew "docbook-xsl"
brew "dopplerhq/cli/doppler"
brew "ed"
brew "expect"
brew "ffmpeg"
brew "file-formula"
brew "findutils"
brew "flac"
brew "git"
brew "git-lfs"
brew "glib"
brew "gnu-getopt"
brew "gnupg"
brew "go"
brew "gpatch"
brew "graphicsmagick"
brew "grep"
brew "groff"
brew "gzip"
brew "heroku-node"
brew "heroku/brew/heroku"
brew "htop"
brew "httpie"
brew "imagemagick"
brew "jq"
brew "kcat"
brew "kops"
brew "kotlin"
brew "krew"
brew "kscript"
brew "ksync"
brew "kubectx"
brew "txn2/tap/kubefwd"
brew "kubernetes-cli"
brew "kubie"
brew "lame"
brew "less"
brew "libxml2"
brew "libxslt"
brew "lsof", link: true
brew "lua"
brew "lz4"
brew "lzlib"
brew "lzo"
brew "mad"
brew "make"
brew "maven"
brew "ncurses"
brew "openjdk"
brew "openjdk@11"
brew "openssl@1.1"
brew "openssl@3"
brew "p11-kit"
brew "p7zip"
brew "pbzip2"
brew "pipenv"
brew "pkg-config"
brew "psutils"
brew "pv"
brew "python@3.10"
brew "python@3.9"
brew "redis-cli"
brew "ripgrep"
brew "rsync"
brew "ruby"
brew "sbt"
brew "screen"
brew "six"
brew "skaffold"
brew "snappy"
brew "snzip"
brew "socat"
brew "sox"
brew "sqlite"
brew "srt"
brew "ssh-copy-id"
brew "stern"
brew "stunnel"
brew "tcpdump"
brew "teleport"
brew "tesseract"
brew "thrift"
brew "tldr"
brew "tmux"
brew "tor"
brew "tree"
brew "unzip"
brew "velero"
brew "vercel-cli"
brew "vim"
brew "watch"
brew "watchexec"
brew "wget"
brew "whois"
brew "youtube-dl"
brew "zlib"
brew "zsh"
brew "zsh-completions"


###############################################################################
# Desktop apps to install via Cask
###############################################################################
cask "1password-cli"
cask "alfred"
cask "android-file-transfer"
cask "bartender"
cask "betterzip"
cask "brave-browser"
cask "caffeine"
cask "camunda-modeler"
cask "charles"
cask "cheatsheet"
cask "cleanshot"
cask "clickup"
cask "dash"
cask "datagrip"
cask "deckset"
cask "discord"
cask "docker"
cask "expressvpn"
cask "figma"
cask "firefox"
cask "font-meslo-for-powerline"
cask "goland"
cask "google-cloud-sdk"
cask "google-drive-file-stream"
cask "graalvm-ce-lts-java11"
cask "grammarly"
cask "handbrake"
cask "iina"
cask "insomnia"
cask "intellij-idea"
cask "keyboard-cleaner"
cask "kindle"
cask "lens"
cask "microsoft-office"
cask "microsoft-teams"
cask "miro"
cask "mono-mdk"
cask "ngrok"
cask "phantomjs"
cask "plex"
cask "plex-media-server"
cask "pritunl"
cask "pycharm"
cask "quickbooks-online"
cask "rectangle"
cask "secure-pipes"
cask "setapp"
cask "sketch"
cask "skype"
cask "sourcetree"
cask "superhuman"
cask "tor-browser"
cask "transmit"
cask "vagrant"
cask "veracrypt"
cask "viscosity"
cask "visual-studio"
cask "vlc"
cask "vmware-fusion"
cask "xquartz"

###############################################################################
# Desktop apps to install via Mac App Store
###############################################################################
mas "Disk Space Analyzer Pro", id: 488920185
mas "EasyRes", id: 688211836
mas "Fantastical", id: 975937182
mas "feedly", id: 865500966
mas "Harvest", id: 506189836
mas "Keynote", id: 409183694
mas "Microsoft Remote Desktop", id: 715768417
mas "Mindnode", id: 1289197285
mas "Numbers", id: 409203825
mas "Omnigraffle 7", id: 1142578753
mas "Pages", id: 409201541
mas "Paste", id: 967805235
mas "Patterns", id: 429449079
mas "Post-It", id: 1475777828
mas "Screenflow 10", id: 1568414480
mas "Smart JSON Editor", id: 1268962404
mas "Textual 7", id: 1262957439
mas "TickTick", id: 966085870
mas "Twitter", id: 1482454543
mas "Vimeo", id: 1356686763
mas "Xcode", id: 497799835

#######################################
# @divideby0 Personal Apps
#######################################
cask "ableton-live-suite"
cask "splice"
cask "spotify"
cask "quicken"
cask "native-access" # Native Instruments Installer
mas "Blackmagic RAW Player", id: 1435415804
mas "Final Cut Pro X", id: 424389933
mas "Logic Pro", id: 634148309
